app/controllers/bookmarks_controller.rb

SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = ?  [["user_id", 1]]
---
  def index
    @bookmarks = current_user.bookmarks.all

INSERT INTO "bookmarks" ("title", "url", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Testing Bookmark 1"], ["url", "http://testing.com"], ["created_at", "2018-02-06 06:45:52.295163"], ["updated_at", "2018-02-06 06:45:52.295163"], ["user_id", 1]]
---
  def create
    @bookmark = current_user.bookmarks.new(bookmark_params)

    respond_to do |format|
      if @bookmark.save

SELECT  "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = ? AND "bookmarks"."id" = ? LIMIT ?  [["user_id", 1], ["id", 3], ["LIMIT", 1]]
---
    def set_bookmark
    unless @bookmark = current_user.bookmarks.where(id: params[:id]).first