app/controllers/site_controller.rb

SELECT "bookmarks".* FROM "bookmarks" ORDER BY created_at desc
---
  def index
    # retrieve all Bookmarks ordered by descending creation timestamp
    @bookmarks = Bookmark.order('created_at desc')